{"id":15043,"date":"2022-09-15T16:50:14","date_gmt":"2022-09-15T22:50:14","guid":{"rendered":"https:\/\/www.henselphelps.com\/?p=15043"},"modified":"2022-09-15T16:50:18","modified_gmt":"2022-09-15T22:50:18","slug":"the-family-behind-the-small-business-celsue-construction-services-inc","status":"publish","type":"post","link":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/","title":{"rendered":"The Family Behind the Small Business: Celsue Construction Services, Inc."},"content":{"rendered":"\n<p>Ruth Davila, President of Celsue Construction Services, Inc., was working as a Professional Engineer (PE) in 2004 when an opportunity presented itself – a chance to buy out Celsue Construction, a certified Minority Business Enterprise (MBE) specializing in Division 32 Concrete. The new role wasn’t an easy one, yet she managed to parent three young children and grow Celsue Construction into a successful business at the same time. Eventually, each of her children tried their hand at the family business and Ruth’s twin daughters, Lorena and Mariana, ultimately made the decision to stay.<\/p>\n\n\n\n<p>The office is currently operated and managed by four uniquely passionate Latin women: Ruth, the President of Celsue Construction; daughter Lorena, who focuses on business development; daughter Mariana, who manages the company’s finances; and Celsue Construction’s newest member, Patricia, Celsue’s Office Manager and helps oversee operations. While building a family-owned and operated small business was an opportunity that Ruth was eager to pursue, it also came with its own set of challenges.<\/p>\n\n\n\n<p>At first, Ruth, Lorena and Mariana did not often meet eye-to-eye when it came between work and family. Now, they must navigate separating the two; their “work family” from their “home family.” What are the dynamics of working with your family day in and day out? Does it change what it means to be a family at “home”? What are the challenges, as well as the benefits? David Fisher, Manager of Supplier Diversity, sat down with them to find out.<\/p>\n\n\n\n<p><strong>David: What made you decide to transition from the engineering field to a small business owner in the Concrete Division 3 area?<\/strong><\/p>\n\n\n\n<p><strong>Ruth: <\/strong><em>I was working with a company where it was difficult to be an engineer as a Latino woman. I had never had this experience before in the industry; I had been welcomed everywhere. But at this company, I was not happy in the environment. I decided that I could do better, I could do something else. My husband, who is also a PE and invests in the real estate business, had a connection with Celsue Construction and found out they were selling the business. The opportunity was presented to me to buy the company, and I thought “Why not?” I didn’t have the money to buy the business, but they offered that I could pay them $50,000 every six months. So, I quit my job and went to work for them for free – they didn’t pay me anything for three months – just to learn the trade.<\/em><\/p>\n\n\n\n<p><strong>David: What did the transition look like from being a licensed PE to a business owner in the construction industry?<\/strong><\/p>\n\n\n\n<p><strong>Ruth:<\/strong> <em>I realized that, while I was an engineer, the construction side was a completely other game. Celsue started with curb and gutter, and I realized I had no idea how to build curb and gutter. So, I started going out with the crews to learn the process. I would have to leave home around 5:00 in the morning to join the crew to really see everything they did. I spent all my time watching those guys. They helped me a lot, not only with learning what they do, but I also learned production because I could see how long it took them to form, finish the concrete, remove the forms and so on.<\/em><\/p>\n\n\n\n<p><strong>David: What was it like to move from a PE career and being safe in corporate America to being a business owner and responsible for employee payroll?<\/strong><\/p>\n\n\n\n<p><strong>Ruth:<\/strong> <em>Oh, it was tough. The first three-five years were tough. I thought “What am I doing? Maybe I should go back to being employed by someone else.” There was a point when I had over $200,000 in credit card debt with an interest of over 20%. But what else was I going to do when I got a concrete invoice for $30,000 per week? If I didn’t pay, they would stop delivering. I don’t have any relatives here; I didn’t have anybody I could borrow money from – I was all on my own. I had no choice but to live on credit cards for three years. That was very painful, but I managed.<\/em><\/p>\n\n\n\n<p><strong>David: What skillset(s) have you acquired or developed that you feel are essential to being a successful business owner in the construction industry?<\/strong><\/p>\n\n\n\n<p><strong>Lorena:<\/strong> <em>My mom is one of the most resilient, strongest people I’ve ever met. It’s not that she necessarily learned skills; she taught people around her in the transition. When I was younger, I saw emails, heard her on the phone and had been to the jobsites where I saw the way men disrespected her. It was disheartening; I would go home and I would think about it for the rest of the day. But my mom never took it from anybody. They would fight with her over a situation and would think that they were right and tell my mom she didn’t know anything. A few days later they would call my mom, apologize, and tell her she was right about the situation all along.<\/em><\/p>\n\n\n\n<p><strong>David: How did having a family impact your decision to move into this career, especially with longer hours?<\/strong><\/p>\n\n\n\n<p><strong>Ruth:<\/strong> <em>My girls were only 11 when I became president of Celsue. My working hours were very long and that was really hard for me. Because I am a mama and, even though I was an engineer, I wanted to be there for my children. Originally, I said I don’t mind if I don’t grow into a president of a corporation – I wanted to make cookies at home with my kids as well.<\/em><\/p>\n\n\n\n<p><strong>Lorena:<\/strong> <em>It was rough. I remember phases throughout our life when our mom was so dedicated to growing the business that we wouldn’t see her for a while. My dad’s the same way. All this happening, the business itself, the working hours, the personality, her leadership style, my leadership style, that all shaped the experiences I’ve gone through in life.<\/em><\/p>\n\n\n\n<p><strong>David: When you saw your mother putting in those long hours, did you ever see yourself following in the same footsteps or going into the same industry?<\/strong><\/p>\n\n\n\n<p><strong>Lorena:<\/strong> <em>Watching my mother grow her business when I was a young child made me realize I love business. I knew from a young age that I was going to one day own my own business. I was the kid in middle school buying candy at Costco and then marking those up to sell to kids in the hallway. My parents also gave me an engineering mindset – you break it apart and figure out how to put it back together. So, when I went to college, I already knew I wanted to go to the business school at the University of Maryland. After that, I went back to school to get my Associates Degree in construction management because I knew I belonged somewhere in construction. I didn’t know where yet, but I knew that the foundation grew from my mother. Our parents sat us down a lot and said “You’re either going to work for someone else for the rest of your life and make them richer every single day or you can go your own way and make your own path and be whomever you want to be. When you do something, you love, the money follows.<\/em><\/p>\n\n\n\n<p><strong>Mariana:<\/strong> <em>I fell into the industry. I had a leave of absence from high school my junior year and I had nothing to do, so my dad would just take me to Celsue, and I would do minimal tasks for my mom. I started working there when I was 15 or 16 and I worked there throughout college. I didn’t go to school for business. I studied cultural anthropology; I did anthropology trips in India, and I’ve always just been interested in that. But I get satisfaction working for my mom.<\/em><\/p>\n\n\n\n<p><strong>David: What are the dynamics of working with family? Challenges? Benefits?<\/strong><\/p>\n\n\n\n<p><strong>Mariana:<\/strong> <em>We had to set boundaries. After 5:00 PM, we told our parents that they couldn’t bring up anything work-related unless it was urgent and was something that had to be done tomorrow. But we had to make it very clear that we do not talk about work after work. Otherwise, work ends up being 24\/7 and you associate your parents with work, and you want to avoid them! I have to keep my work mom separate from my home mom; it ends up being two different relationships.<\/em><\/p>\n\n\n\n<p><strong>Lorena:<\/strong> <em>Before we set those boundaries, it was working at breakfast; working while grabbing my coffee; working at lunch; working on a three-hour car ride to the beach. Work mom and home mom were interchangeable; it was the same 24\/7. But the beautiful thing about being a family and working together is we understand each other’s weaknesses and strengths. We all try to accommodate each other so that we can be the best version of ourselves. There are times when I have a breakdown at work and I’m super stressed. My mom might be super busy dealing with a bunch of bids, but she’ll stop what she’s doing, and we’ll sit down and have a mom-to-daughter pep talk. Who does that anywhere else? A lot of people spend so much time at work and they have such little family time because they have such little social life. But I get to have a social life and be with my family and work at the same time.<\/em><\/p>\n\n\n\n<p><strong>David: What is the future for Celsue Construction?<\/strong><\/p>\n\n\n\n<p><strong>Ruth:<\/strong> <em>Well, their father is pushing them to follow the family business, but I always tell the girls they need to spend the rest of their lives doing something they like. If they don’t like it at Celsue, don’t work here. My son came to work for me when he graduated from university, and he couldn’t take it. He was there for three months and said “Mom, I don’t know how you love this. I hate it.” And I told him to hit the road.<\/em><\/p>\n\n\n\n<p><strong>Lorena:<\/strong> <em>We definitely want to take over, but I want to combine my own dream into it. I want to open another department that focuses on flipping residential properties and investing in commercial buildings. Mariana and I want to have a subsidiary that focuses on the residential investment side, but we’re not there yet. We have a lot to learn.<\/em><\/p>\n\n\n\n<p><strong>David: If Celsue were to create a Back to the Future movie about your company and experience, what information would the 2022 version of yourself share with the 2004 version of yourself?<\/strong><\/p>\n\n\n\n<p><strong>Mariana:<\/strong> <em>I’d say it gets better. In the beginning, we felt so lost. There were so many times we thought we would shut down.<\/em><strong>Lorena:<\/strong><em>I also didn’t realize how important consistency and perseverance are. I would tell our younger selves that that’s all you really need and everything else will follow. When you’re consistent and persevere, nothing is going to get in your way and even if it does, get up and keep going.<\/em><em>I would also tell the younger version of ourselves that if there’s a decision you have to make, choose the decision that makes you more uncomfortable. Because when you stay in your comfort zone, you don’t really grow. If it doesn’t challenge, you it doesn’t change you.<\/em><\/p>\n<div style=\"margin-top: 0px; margin-bottom: 0px;\" class=\"sharethis-inline-share-buttons\" ><\/div>","protected":false},"excerpt":{"rendered":"<p>Ruth Davila, President of Celsue Construction Services, Inc., was working as a Professional Engineer (PE) in 2004 when an opportunity presented itself – a chance to buy out Celsue Construction, a certified Minority Business Enterprise (MBE) specializing in Division 32 Concrete. The new role wasn’t an easy one, yet she managed to parent three young [&hellip;]<\/p>\n","protected":false},"author":36,"featured_media":15044,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[12],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v20.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Family Behind the Small Business: Celsue Construction Services, Inc. - Alticor Inc<\/title>\n<meta name=\"description\" content=\"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Family Behind the Small Business: Celsue Construction Services, Inc.\" \/>\n<meta property=\"og:description\" content=\"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/\" \/>\n<meta property=\"og:site_name\" content=\"Alticor Inc\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/HenselPhelpsCommunications\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-09-15T22:50:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-15T22:50:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/henselphelps.com\/wp-content\/uploads\/2022\/09\/Building-Together-Graphics_Green-and-Yellow_Fam-Behind-Biz-Article-and-Social.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2500\" \/>\n\t<meta property=\"og:image:height\" content=\"1312\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Peyton Pritekel\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:description\" content=\"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.\" \/>\n<meta name=\"twitter:creator\" content=\"@HenselPhelps\" \/>\n<meta name=\"twitter:site\" content=\"@HenselPhelps\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Peyton Pritekel\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/\",\"url\":\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/\",\"name\":\"The Family Behind the Small Business: Celsue Construction Services, Inc. - Alticor Inc\",\"isPartOf\":{\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#website\"},\"datePublished\":\"2022-09-15T22:50:14+00:00\",\"dateModified\":\"2022-09-15T22:50:18+00:00\",\"author\":{\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/61a8171fa6c59eddbf5ed9b9d22b9e6e\"},\"description\":\"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.\",\"breadcrumb\":{\"@id\":\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/publicwebsite.azurewebsites.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Family Behind the Small Business: Celsue Construction Services, Inc.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#website\",\"url\":\"https:\/\/publicwebsite.azurewebsites.net\/\",\"name\":\"Alticor Inc\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/publicwebsite.azurewebsites.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/61a8171fa6c59eddbf5ed9b9d22b9e6e\",\"name\":\"Peyton Pritekel\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/3904aa0d1f1eea413748d04b86b9d36d?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/3904aa0d1f1eea413748d04b86b9d36d?s=96&d=mm&r=g\",\"caption\":\"Peyton Pritekel\"},\"url\":\"https:\/\/henselphelps.com\/author\/peyton_pritekel\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"The Family Behind the Small Business: Celsue Construction Services, Inc. - Alticor Inc","description":"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/","og_locale":"en_US","og_type":"article","og_title":"The Family Behind the Small Business: Celsue Construction Services, Inc.","og_description":"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.","og_url":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/","og_site_name":"Alticor Inc","article_publisher":"https:\/\/www.facebook.com\/HenselPhelpsCommunications\/","article_published_time":"2022-09-15T22:50:14+00:00","article_modified_time":"2022-09-15T22:50:18+00:00","og_image":[{"width":2500,"height":1312,"url":"https:\/\/henselphelps.com\/wp-content\/uploads\/2022\/09\/Building-Together-Graphics_Green-and-Yellow_Fam-Behind-Biz-Article-and-Social.jpg","type":"image\/jpeg"}],"author":"Peyton Pritekel","twitter_card":"summary_large_image","twitter_description":"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.","twitter_creator":"@HenselPhelps","twitter_site":"@HenselPhelps","twitter_misc":{"Written by":"Peyton Pritekel","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/","url":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/","name":"The Family Behind the Small Business: Celsue Construction Services, Inc. - Alticor Inc","isPartOf":{"@id":"https:\/\/publicwebsite.azurewebsites.net\/#website"},"datePublished":"2022-09-15T22:50:14+00:00","dateModified":"2022-09-15T22:50:18+00:00","author":{"@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/61a8171fa6c59eddbf5ed9b9d22b9e6e"},"description":"Ruth Davila was working as a Professional Engineer (PE) in 2004 when a chance to buy out Celsue Construction presented itself.","breadcrumb":{"@id":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/henselphelps.com\/the-family-behind-the-small-business-celsue-construction-services-inc\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/publicwebsite.azurewebsites.net\/"},{"@type":"ListItem","position":2,"name":"The Family Behind the Small Business: Celsue Construction Services, Inc."}]},{"@type":"WebSite","@id":"https:\/\/publicwebsite.azurewebsites.net\/#website","url":"https:\/\/publicwebsite.azurewebsites.net\/","name":"Alticor Inc","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/publicwebsite.azurewebsites.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/61a8171fa6c59eddbf5ed9b9d22b9e6e","name":"Peyton Pritekel","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/3904aa0d1f1eea413748d04b86b9d36d?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/3904aa0d1f1eea413748d04b86b9d36d?s=96&d=mm&r=g","caption":"Peyton Pritekel"},"url":"https:\/\/henselphelps.com\/author\/peyton_pritekel\/"}]}},"_links":{"self":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15043"}],"collection":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/users\/36"}],"replies":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/comments?post=15043"}],"version-history":[{"count":1,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15043\/revisions"}],"predecessor-version":[{"id":15045,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15043\/revisions\/15045"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/media\/15044"}],"wp:attachment":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/media?parent=15043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/categories?post=15043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/tags?post=15043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}