{"id":15390,"date":"2022-11-04T14:06:44","date_gmt":"2022-11-04T20:06:44","guid":{"rendered":"https:\/\/www.henselphelps.com\/?p=15390"},"modified":"2022-11-04T14:26:11","modified_gmt":"2022-11-04T20:26:11","slug":"fawcett-elementary-school-becomes-a-vdc-playground","status":"publish","type":"post","link":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/","title":{"rendered":"Fawcett Elementary School Becomes a VDC Playground"},"content":{"rendered":"\n<p>Virtual Design and Construction (VDC) is a tool that helps construction teams visualize what they are building on-site. It allows project teams to analyze and coordinate digital models and other assets that will help them reduce project complications. VDC mitigates potential project issues by highlighting where problems may occur and provides data that will help illustrate possible solutions. In the past, these efforts would have been reserved for bigger and more complex projects, but as technologies modernize, VDC and Building Information Management (BIM) have become more accessible and realistic to have on all construction projects, no matter their size.<\/p>\n\n\n\n<p>The Tacoma Public Schools <a href=\"https:\/\/www.henselphelps.com\/project\/fawcett-elementary-school-replacement\/\">Fawcett Elementary School Replacement<\/a> project (Fawcett), located in Tacoma, Washington, is a 50,000 SF building with a $33.8 million progressive design-build contract. The project is delivered with BLRB Architects and is scheduled to complete in July of 2023.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full is-resized\"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2022\/11\/Enscape_2022-05-23-16-02-50_small.png\" alt=\"\" class=\"wp-image-15394\" width=\"512\" height=\"288\" srcset=\"\/wp-content\/uploads\/2022\/11\/Enscape_2022-05-23-16-02-50_small.png 682w, \/wp-content\/uploads\/2022\/11\/Enscape_2022-05-23-16-02-50_small-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/><figcaption>Rendering from BLRB Architects that shows the completed Fawcett Elementary School. Construction is scheduled to complete in July 2023. <br>(Image: BLRB Architects)<\/figcaption><\/figure><\/div>\n\n\n<p>Despite its relatively small size, the project provides many opportunities to utilize VDC tools ranging from laser scanning concrete slab-on-grade for the analyzation of floor flatness, to 3D BIM coordination of mechanical, electrical, plumbing and fire protection.<\/p>\n\n\n\n<p>Carlos Cardenas, a lead VDC engineer for Alticor Inc in the Pacific Northwest region, leads the VDC effort at Fawcett. While his initial task was to implement standard VDC elements, he and the field team soon realized that VDC could greatly impact the project.<\/p>\n\n\n\n<p>“The pace of a smaller project really lends itself to having the capacity to explore,” said Cardenas.<\/p>\n\n\n\n<p>From there, he took the initiative to create new tools for the team and understand which elements excited them and provided the most help.<\/p>\n\n\n\n<p>“Like when you’re cooking spaghetti, you throw it at the wall to see if it sticks, and that’s what a smaller project allows me to do. I can throw something at the superintendents and see what their reaction is and what sticks,” said Cardenas.<\/p>\n\n\n\n<p>The combination of right timing and an excited on-site crew allowed Cardenas the opportunity to continue supporting the field team, and together they were able to turn Fawcett into a VDC playground.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4><strong>Elevating the owner’s experience<\/strong><\/h4>\n\n\n\n<p>Fawcett had no expectations of VDC involvement or requirements during the construction phase, but it was something that the Alticor Inc team knew would benefit the project.<\/p>\n\n\n\n<p>Ryan Weinrich, senior VDC manager in the Pacific Northwest, and project superintendent Seth Stenerodden sat down early on in preconstruction to discuss design coordination. Together, they knew that even though there wasn’t a requirement from the owner, they wanted to step in and lead the VDC process.<\/p>\n\n\n\n<p>Stenerodden and area superintendent Thomas Browning spoke enthusiastically about how helpful VDC has been on the project and how it has allowed the project to run smoothly.<\/p>\n\n\n\n<p>“VDC helps tremendously. It helps when coordinating with every single trade partner, and being able to see problems in the model before it’s built in the field and is a huge benefit to the project, both cost and coordination wise,” said Stenerodden.<\/p>\n\n\n\n<p>Tacoma Public Schools was impressed by the initiative taken by the the on-site team, seeing the first-hand benefits of incorporating VDC into their project.<\/p>\n\n\n\n<p>“VDC is new to the owner. They know about it but haven’t used it on many other projects, so they’ve mostly been an observer. We have really &#8216;wowed&#8217; them with the stuff that we have done, especially when we brought in their maintenance team while we were still in the design phase,” said Kate Westerlund, project manager of Fawcett.<\/p>\n\n\n\n<p>From a VDC perspective, the tools that are developed and shared are typically project-specific and always with the end user in mind. Receiving input from both immediate field staff and those who would inevitably use and service the building was also an important step in the process.<\/p>\n\n\n\n<p>To ensure that the maintenance team could do their job with ease once the school was finished, the team invited the Tacoma School District Maintenance and Sustainability Group after most of the systems had been coordinated. They were then able to use the HoloLens (mixed reality smart glasses) to guarantee that all necessary equipment and devices were accessible.<\/p>\n\n\n\n<p>“Their head of maintenance was elated that we brought them in after it was coordinated. We used the HoloLens so they could walk around in virtual reality and physically see how they are going to be able to reach a piece of equipment that has frequent maintenance requirements,” said Browning.<\/p>\n\n\n\n<p>These steps were impactful not only for the functionality of the design, but to help make the maintenance team feel seen and prioritized.<\/p>\n\n\n\n<p>“They said, ‘This is the first time anybody has asked us, much less listened to a request that we’ve had,’ so they really liked that from a maintenance standpoint,” said Browning.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4><strong>Communicating with VDC<\/strong><\/h4>\n\n\n\n<p>One of the greatest draws to utilizing VDC is its ability to reduce miscommunications.<\/p>\n\n\n\n<p>“The benefits are endless when it comes to being able to communicate, it’s a communication tool essentially,” said Stenerodden.<\/p>\n\n\n\n<p>A creative way the team utilized VDC technology was by using the orthographic photos gathered during the weekly drone flights to visually communicate upcoming schedules. Browning shared that when schedules are presented in a spreadsheet, the information can sometimes be confusing. To reduce confusion, Browning started putting the schedule on weekly site maps to help visualize where each activity was happening and make the schedule more digestible. The owner found this helpful and it became a key system for sharing the schedule with the team, owner and trade partners.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2022\/11\/Schedule_Small.png\" alt=\"\" class=\"wp-image-15395\" width=\"836\" height=\"545\" srcset=\"\/wp-content\/uploads\/2022\/11\/Schedule_Small.png 634w, \/wp-content\/uploads\/2022\/11\/Schedule_Small-300x195.png 300w\" sizes=\"(max-width: 836px) 100vw, 836px\" \/><figcaption>Upcoming construction schedule labeled on an orthographic photo to help visualize tasks. These schedules were created to help communicate workload with the owner, trade partners and the Alticor Inc team.<\/figcaption><\/figure><\/div>\n\n\n<p>“Once people have orthographic photos and see how they’re used, they don’t ever want to live life without them,” said Browning.<\/p>\n\n\n\n<p>Office engineer Mac Nisbet said that one of his favorite features of VDC is its ability to solve problems before they happen.<\/p>\n\n\n\n<p>“It gives us the opportunity to coordinate between trades and solve a problem before it gets installed in the field,” said Nisbet.<\/p>\n\n\n\n<p>Using field iPads to access the 3D model while working in the field is also a shared favorite by the team. When solely referring to 2D models, there is more room for misinterpretations in the design, whereas 3D models make it easier to tell when, where and how each part is installed.<\/p>\n\n\n\n<p>“It’s one thing to look at drawings, but it’s nice to be able to pull the model up in a 3D view on the iPad and show a subcontractor exactly what they’re doing,” said Ashton Corcoran, field engineer at Fawcett.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2022\/11\/DSC_0850_small-1024x683.jpg\" alt=\"\" class=\"wp-image-15396\" width=\"512\" height=\"342\" srcset=\"\/wp-content\/uploads\/2022\/11\/DSC_0850_small-1024x684.jpg 1024w, \/wp-content\/uploads\/2022\/11\/DSC_0850_small-300x200.jpg 300w, \/wp-content\/uploads\/2022\/11\/DSC_0850_small-768x512.jpg 768w, \/wp-content\/uploads\/2022\/11\/DSC_0850_small-391x260.jpg 391w, \/wp-content\/uploads\/2022\/11\/DSC_0850_small-1536x1024.jpg 1536w, \/wp-content\/uploads\/2022\/11\/DSC_0850_small.jpg 1773w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/><figcaption>Carlos Cardenas uses a field iPad at Fawcett Elementary School Replacement to check the work being done onsite. Through the field iPad, Cardenas can view the coordinated 3D model from any location on site. <\/figcaption><\/figure><\/div>\n\n\n<h4><strong>Mitigating constructability issues through training and teamwork<\/strong><\/h4>\n\n\n\n<p>The most common use of VDC on any given project is facilitating communication with and between trade partners during the construction phase. Teams utilize VDC for identifying design conflicts between all disciplines using Navisworks, a clash detection software that helps to mitigate constructibility issues in the field. This system works by analyzing the 3D model and identifying conditions that collide so the issues can be worked out before materials are ordered, fabricated and installed in the field. This technology also helps reduce delays and keeps the project on schedule by working out issues ahead of time.<\/p>\n\n\n\n<p>“We are a 5.5-acre site, our overall building is 55,000 SF and we still have the same systems. If they aren’t coordinated, whether it is small or large, it slows the schedule down,” said Browning.<\/p>\n\n\n\n<p>VDC has proven to be a helpful and successful addition to the project, however, for a region with a VDC team of just three, it can be challenging to get each member fully immersed in each project. There is now a push to train the on-site teams to take over some of the responsibilities historically handled by VDC personnel such as running 3D coordination meetings with trade partners and recurring drone flights to help make some of the tasks independent within each project.<\/p>\n\n\n\n<p>“Since Carlos was available, he came out, ran the operation and trained our younger people onsite to run the coordination. Due to Carlos’ availability, we now have office and field engineers who could go to the next job and run this,” said Westerlund.<\/p>\n\n\n\n<p>With the understanding that younger employees are eager to learn this new technology, Area Superintendent Thomas Browning stated that team is focused on training their field and office engineers to take over some of the VDC tasks.<\/p>\n\n\n\n<p>While creating lift drawings has slowly migrated from a field engineers responsibility to a VDC engineers responsibility, Alticor Inc has made it a company-wide objective to put the effort back into the hands of field engineers. This is something Cardenas trained Ashton Corcoran to do early on, and Corcoran was able to successfully continue this effort throughout the project. Lift drawings are now independently created by the Fawcett team and are self-sustained within their project since Corcoran was able to take over and keep producing them.<\/p>\n\n\n\n<p>Nisbet said the most helpful VDC tool for him was the lift drawings, which made a big difference in being able to do his job efficiently. “The lift drawings were huge because it was the only way we could have been as successful in the field as we were with our self-performed concrete,” said Nisbet.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2022\/11\/DJI_0490-edit-resized_small.png\" alt=\"\" class=\"wp-image-15397\" width=\"834\" height=\"551\"\/><figcaption>Alticor Inc VDC team documents progress at the Fawcett Elementary School Replacement project located in Tacoma, Wash. on Oct. 6, 2022. The team is working collaboratively with their design-build partner, BLRB Architects, to have the school ready for the Fawcett Falcons next Fall.<\/figcaption><\/figure><\/div>\n\n\n<h4 id=\"h-exploring-vdc-solutions-through-early-involvement\"><strong>Exploring VDC solutions through early involvement<\/strong><\/h4>\n\n\n\n<p>Sitting down with the VDC team early to review their service menu at the beginning of each project can be a very important step. The VDC team can offer helpful solutions and ideas that not everyone may be aware of.<\/p>\n\n\n\n<p>“For any project starting up, talk to VDC, sit down with us and go through our menu of services. Even if it’s not in the contract, just exploring the opportunities anyway, and exploring them early on, might allow our team to identify a possible solution that might not have been previously explored,” said Cardenas.<\/p>\n\n\n\n<p>The main takeaway that almost every team member had to share was to get started earlier. VDC was brought in during preconstruction at Fawcett, but the team could have done even more if they had just started conversations earlier.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2022\/11\/DSC_0148_small-1024x683.jpg\" alt=\"\" class=\"wp-image-15398\" width=\"512\" height=\"342\" srcset=\"\/wp-content\/uploads\/2022\/11\/DSC_0148_small-1024x684.jpg 1024w, \/wp-content\/uploads\/2022\/11\/DSC_0148_small-300x200.jpg 300w, \/wp-content\/uploads\/2022\/11\/DSC_0148_small-768x512.jpg 768w, \/wp-content\/uploads\/2022\/11\/DSC_0148_small-391x260.jpg 391w, \/wp-content\/uploads\/2022\/11\/DSC_0148_small-1536x1024.jpg 1536w, \/wp-content\/uploads\/2022\/11\/DSC_0148_small.jpg 1773w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/><figcaption>Carlos Cardenas prepares to fly the drone to take orthographic photos of Fawcett Elementary School Replacement project. These photos can then be used to document progress and communicate upcoming schedules and tasks. <\/figcaption><\/figure><\/div>\n\n\n<h4><strong>Embracing VDC as a team<\/strong><\/h4>\n\n\n\n<p>The Fawcett team boasted about all the ways VDC had helped them on their project, contributing their  success to their drive to learn new skills and embracing new technologies.<\/p>\n\n\n\n<p>“Going forward, I would like to see this level of innovation utilized on future projects,” said Stenerodden. “It’s a much better way to visualize and see the way something is going to be built.”<\/p>\n\n\n\n<p>The Fawcett team is constantly getting involved in VDC projects and they stay open to learning new tools that will help them along the way. Not only does the onsite team want access to more VDC tools, but it is no longer as intimidating and expensive as it used to be. VDC is accessible and is something the onsite teams, trade partners and owners love and depend on.<\/p>\n\n\n\n<p>“The success that I see on this job is driven by the staff’s engagement with the tools and their willingness to learn something new,” said Weinrich. “Even though they don’t have a big budget or a lot of time, they’ve taken these tools and ran with them.”<\/p>\n\n\n\n<p>All things considered, VDC is still relatively new, and the tools are constantly developing along with the way they’re being used. Through collaboration of the VDC and onsite teams the tools and processes are able to be developed to better fit onsite needs.<\/p>\n\n\n\n<p>The Fawcett and VDC team have exceeded expectations for this project by encouraging others to get involved and embracing everything that has been given to them. This team has learned firsthand how helpful VDC technologies can be and they’re excited to take this knowledge with them to their next project(s).<\/p>\n\n\n\n<p>“It can be a little intimidating at first if you’re not familiar with it, but ask for help because there’s a lot of cool things it can do that you probably didn’t realize,” said Nisbet. “Embrace VDC, because this is where construction is going.”<\/p>\n<div style=\"margin-top: 0px; margin-bottom: 0px;\" class=\"sharethis-inline-share-buttons\" ><\/div>","protected":false},"excerpt":{"rendered":"<p>Virtual Design and Construction (VDC) is a tool that helps construction teams visualize what they are building on-site. It allows project teams to analyze and coordinate digital models and other assets that will help them reduce project complications. VDC mitigates potential project issues by highlighting where problems may occur and provides data that will help [&hellip;]<\/p>\n","protected":false},"author":41,"featured_media":15393,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[243],"tags":[74,66],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v20.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Fawcett Elementary School Becomes a VDC Playground - Alticor Inc<\/title>\n<meta name=\"description\" content=\"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Fawcett Elementary School Becomes a VDC Playground\" \/>\n<meta property=\"og:description\" content=\"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/\" \/>\n<meta property=\"og:site_name\" content=\"Alticor Inc\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/HenselPhelpsCommunications\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-11-04T20:06:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-11-04T20:26:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/henselphelps.com\/wp-content\/uploads\/2022\/11\/DSC_0121_medium.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1773\" \/>\n\t<meta property=\"og:image:height\" content=\"1182\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Jennifer Coyne\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:description\" content=\"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.\" \/>\n<meta name=\"twitter:creator\" content=\"@HenselPhelps\" \/>\n<meta name=\"twitter:site\" content=\"@HenselPhelps\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jennifer Coyne\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/\",\"url\":\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/\",\"name\":\"Fawcett Elementary School Becomes a VDC Playground - Alticor Inc\",\"isPartOf\":{\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#website\"},\"datePublished\":\"2022-11-04T20:06:44+00:00\",\"dateModified\":\"2022-11-04T20:26:11+00:00\",\"author\":{\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/92e2041a0c259aacd61f01d7052c6166\"},\"description\":\"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.\",\"breadcrumb\":{\"@id\":\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/publicwebsite.azurewebsites.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Fawcett Elementary School Becomes a VDC Playground\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#website\",\"url\":\"https:\/\/publicwebsite.azurewebsites.net\/\",\"name\":\"Alticor Inc\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/publicwebsite.azurewebsites.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/92e2041a0c259aacd61f01d7052c6166\",\"name\":\"Jennifer Coyne\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/80320272f3349692f18b4bf29839f50d?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/80320272f3349692f18b4bf29839f50d?s=96&d=mm&r=g\",\"caption\":\"Jennifer Coyne\"},\"url\":\"https:\/\/henselphelps.com\/author\/jennifer_coyne\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Fawcett Elementary School Becomes a VDC Playground - Alticor Inc","description":"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/","og_locale":"en_US","og_type":"article","og_title":"Fawcett Elementary School Becomes a VDC Playground","og_description":"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.","og_url":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/","og_site_name":"Alticor Inc","article_publisher":"https:\/\/www.facebook.com\/HenselPhelpsCommunications\/","article_published_time":"2022-11-04T20:06:44+00:00","article_modified_time":"2022-11-04T20:26:11+00:00","og_image":[{"width":1773,"height":1182,"url":"https:\/\/henselphelps.com\/wp-content\/uploads\/2022\/11\/DSC_0121_medium.jpg')}}" ,"type":"image\/jpeg"}],"author":"Jennifer Coyne","twitter_card":"summary_large_image","twitter_description":"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.","twitter_creator":"@HenselPhelps","twitter_site":"@HenselPhelps","twitter_misc":{"Written by":"Jennifer Coyne","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/","url":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/","name":"Fawcett Elementary School Becomes a VDC Playground - Alticor Inc","isPartOf":{"@id":"https:\/\/publicwebsite.azurewebsites.net\/#website"},"datePublished":"2022-11-04T20:06:44+00:00","dateModified":"2022-11-04T20:26:11+00:00","author":{"@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/92e2041a0c259aacd61f01d7052c6166"},"description":"The Alticor Inc Fawcett Elementary School Replacement team uses high levels of VDC in the field to mitigate constructibility issues.","breadcrumb":{"@id":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/henselphelps.com\/fawcett-elementary-school-becomes-a-vdc-playground\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/publicwebsite.azurewebsites.net\/"},{"@type":"ListItem","position":2,"name":"Fawcett Elementary School Becomes a VDC Playground"}]},{"@type":"WebSite","@id":"https:\/\/publicwebsite.azurewebsites.net\/#website","url":"https:\/\/publicwebsite.azurewebsites.net\/","name":"Alticor Inc","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/publicwebsite.azurewebsites.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/92e2041a0c259aacd61f01d7052c6166","name":"Jennifer Coyne","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/publicwebsite.azurewebsites.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/80320272f3349692f18b4bf29839f50d?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/80320272f3349692f18b4bf29839f50d?s=96&d=mm&r=g","caption":"Jennifer Coyne"},"url":"https:\/\/henselphelps.com\/author\/jennifer_coyne\/"}]}},"_links":{"self":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15390"}],"collection":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/users\/41"}],"replies":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/comments?post=15390"}],"version-history":[{"count":11,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15390\/revisions"}],"predecessor-version":[{"id":15446,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/posts\/15390\/revisions\/15446"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/media\/15393"}],"wp:attachment":[{"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/media?parent=15390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/categories?post=15390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/henselphelps.com\/wp-json\/wp\/v2\/tags?post=15390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}